src/test/resources/soap/filecredit.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:smar="http://localhost/SmartPayments/">
    <soap:Header/>
    <soap:Body>
        <smar:GetCardType>
            <!--Optional:-->
            <smar:CardNumber>%s</smar:CardNumber>
        </smar:GetCardType>
    </soap:Body>
</soap:Envelope>